<template>
  <div>
    <el-breadcrumb separator-class="el-icon-arrow-right">
      <el-breadcrumb-item :to="{ path: '/home/news' }">猫咪资讯</el-breadcrumb-item>
      <el-breadcrumb-item>你不知道的猫咪发腮冷知识</el-breadcrumb-item>
    </el-breadcrumb>
    <div class="title">你不知道的猫咪发腮冷知识</div>
    <p>
      现在人真是奇怪，人变胖了就会被各种嫌弃鄙视，但是如果自家猫咪肥肥胖胖就会被赞又萌又可爱，很多铲屎官们为了让猫咪长得胖乎乎的，使出浑身解数，高蛋白猫粮、各种营养素，一吃饱就伺候自家主子去睡觉，就想着让主子尽快膨胀起来，可真等猫咪胖起来了，但脸蛋却还是尖尖的，这个样子就像是一个纺锤。只胖身体而不是胖脸蛋，铲屎官们只想要一个发腮的猫咪怎么这么难呢？其实关于猫咪发腮，有些事情你可能不知道？
    </p>
    <img src="../assets/N6.png" />
    <p>
      <span>第一：猫咪发腮的原因</span><br />
      猫咪所谓的“腮”在英文里称为“stud
      jowls”，发腮就是猫咪的腮部与颈部出现垂肉其实是公猫特有的身体特征。腮的作用可不少，例如：公猫交配时可以防止被咬伤颈动脉。，所以腮除了满足人类的审美，主要是提升猫咪战斗时的气场，不管是抢地盘还是找对象，宽厚明显的腮帮子都能让你在群猫中脱颖而出。在喵星人的世界里，腮的发育，就等同于人类小男生冒头的胡渣和突起的喉结，是发育的象征。
      可是如果铲屎官养的是一只母猫，那么猫咪变成胖脸的概率就会小很多，而且母猫长胖后的情况也会和发腮有些类似，这也给铲屎官造成了一些误解，觉得母猫会发腮，但是实际上它是被你喂胖了。
      要是你的母猫是真的长出了类似公猫的厚腮，不要开心自己捡到宝了，你可能该带主子去医院检查了。因为2000年，美国密歇根州一动物医院接诊了一只有着公猫样突出腮帮子的母猫。经过检查，发现是由于一种原发性卵巢肿瘤造成了血清睾酮含量异常升高，引起的行为外表雄性化。切除肿瘤后，睾酮水平恢复正常，雄性化症状消失，之前厚厚的腮帮子消失了，所以发腮的母猫不是惊喜是惊吓！
    </p>
    <p class="text1">
      <span> 第二：容易发腮猫咪品种</span>
      发腮的猫咪的品种总体上来说，英短系、加菲猫、金吉拉等品种的猫咪发腮的概率是很大的，获得一只发腮的大脸猫并不难。当然也有绝对无法发腮的猫咪，包括有：暹罗猫、无毛猫、德文猫、东短毛猫、俄罗斯蓝猫等，这些猫咪基因中根本就没有发腮的可能性。如果你家里的猫咪是这几种，那么请尽早打消念头吧，因为这类猫咪就算是长胖，脸蛋也不会变得圆润，只会像一个纺锤一样，头小肚子大。
    </p>
    <p class="text1">
      <span> 第三：公猫的绝育时间</span>
      前面说到公猫发腮是雄性激素的刺激下出现的，所以在公猫发情之前铲屎官带它做了绝育，那么它这辈子可能就跟“腮”无缘了。如果你想要一只脸蛋大大的猫咪，便可以将绝育时间往后延延，猫咪发腮时间可以持续到三岁左右，如果猫咪一直发腮是可以生长到很大很圆的腮部。发腮后才绝育的猫咪，腮是会保留，但随着体内睾酮水平下降，有可能会影响腮的大小，出现腮帮子变小的情况。
    </p>
    <img src="../assets/N7.jpg" />
    <p>
      <span> 第四、发腮要补充适当的营养保健品</span>
      铲屎官们一听说高蛋白就囤一堆牛肉鱼肉在家里狂喂猫咪，其实这并没有科学依据，猫咪发腮阶段的确需要补充高蛋白，但是如果猫咪挑食、不爱吃饭，身体抵抗力差，这个时候就需要补充营养素，促进猫咪采食和脂肪沉淀，比如可以尝试喂猫咪一些拜卡糖萜素，猫舍圈里的人称之为猫咪“肥宅水”，作为常备营养品来喂就可以，不仅可以增肥增重发腮，还可以增进生殖功能，促进肠胃消化，抗应激，提高免疫力，清除自由基，抗氧化，促进蛋白质合成，增强消化酶活性等等。
      总的来说，糖萜素是非常好的一种猫咪日常补充剂，可以每天都给猫咪吃。特别是对以胖为美或者体质瘦弱的猫咪来说，日常补充，用糖萜素，是不二之选。
    </p>
  </div>
</template>

<script>
export default {};
</script>

<style lang="less" scoped>
div {
  width: 60%;
  margin: 0 auto;
  position: relative;
    top: 17px;

  .el-breadcrumb {
    position: absolute;
    top: -15px;
    left: -150px;
    font-size: 15px;
  }

  .title {
    width: 100%;
    height: 82px;
    line-height: 50px;
  }
  p {
    text-indent: 20px;
    font-size: 17px;
    line-height: 30px;

    span {
      font-weight: bolder;
    }
  }

  img {
    margin-top: 25px;
    margin-left: 45px;
    margin-bottom: 25px;
    width: 600px;
    height: 440px;
  }

  .text1 {
    margin-top: 25px;
  }
}
</style>