<template>
  <div>
    <div class="card1">
      <div class="title">猫咪知识</div>
      <el-card shadow="hover">
        <h3>布偶猫</h3>
        <img v-lazy="msg1" alt="布偶猫" title="布偶猫" />
        <p class="a1">
          <span>生理特征：</span>
          布偶猫体型较大、慵懒、毛发中等长度。公猫体重可达7-10公斤，母猫体重可达4.5-7公斤。公猫体长可以超过1米（含尾巴）。
          布偶猫有着迷人的、且微向上扬起的蓝色眼睛。头部呈等边三角形，耳朵中等大小，两只耳朵距离较远，耳尖且向前倾。鼻子中等长度。
          布偶猫是一个重点色的品种（重点色——身体的颜色比重点位置（脸、腿、尾巴、耳朵）的颜色要浅），分三个品种：重点色（colorpoint）、bicolor（双色）和mitted（戴手套——腿上只有脚是白色的）。每个品种都有海豹色、蓝色、巧克力色、浅紫色、月桂色、浅黄褐色、红色、奶油色，也可以附加有玳瑁、山猫或虎斑纹。
          布偶猫算是比较晚熟的品种，一般最早3岁，最晚4-5岁才可以算发育完全。
        </p>
        <p class="a2">
          <span>性格特点：</span>
          布偶猫放松、开心、就像小孩子的玩偶一样。它们友爱、安静、看起来比较懒散。它们不是很活跃、也不太爱叫。布偶猫以它们的忍受力著称，它们能忍受穿上衣服，并且被抱着走动，不会反抗。因为它们的友好和聪慧，它们经常被拿到与狗进行类比。
        </p>
      </el-card>
    </div>
    <el-card shadow="hover">
      <h3>狸花猫</h3>
      <img v-lazy="msg2" alt="狸花猫" title="狸花猫" />
      <p class="a1">
        <span>生理特征： </span>
        狸花猫头部非常圆，面颊非常宽大，两只耳朵的间距相比较远，耳朵的大小十分合适，具有宽大的耳根，深厚的耳郭，而且位于尖端的部分比较圆滑。眼睛大而有神，圆杏核的形状，人们目前认可从黄色、金色到绿色不等的过渡颜色。一般情况下是眼睛会有眼线出现。鼻子长有鼻线，呈现砖红色的。狸花猫身材适中，胸腔比较宽阔。四肢同尾巴一样，都是长度适中的，比例协调，具有较大的力气，肌肉发达。
      </p>
      <p class="b3">
        <span>性格特点：</span>
        狸花猫个性独立，活泼好动，对周围环境的改变非常敏感，一旦饲主有了变更，会对它们的心理造成不同程度的伤害。成年狸花猫并不太爱与人玩耍，但它又会时刻出现于人的视力范围内。如果你喜欢含蓄、自信又忠诚的猫种，那么，狸花猫是不错的选择。
      </p>
    </el-card>
    <el-card shadow="hover">
      <h3>英国短毛猫</h3>
      <img v-lazy="msg3" alt="英国短毛猫" title="英国短毛猫" />
      <p class="a1">
        <span> 生理特征：</span>
        如果用一个词来形容英国短毛猫，那一定是“结实”。公猫体重大约在4-8公斤，母猫体重大约在3-5.5公斤。英国短毛猫到3岁时才会停止发育，寿命在15年左右。
        英国短毛猫被毛短、密致、有绒质手感。它们头很圆、鼻子比较短、脸颊饱满、圆形的胡须垫很突出。眼睛又大又圆。
        蓝色是英国短毛猫最经典的颜色，由于它异乎寻常的流行性，蓝色的英国短毛猫也被称为“蓝猫”。
      </p>
      <p class="b3">
        <span> 性格特点：</span>
        英国短毛猫很常见，它们友好、友爱，不是特别粘人，但是也很享受人们的关心爱护。它们忠诚，但不喜欢待在人们腿上，他们更喜欢在沙发上挤在你边上，人们称之为“四只脚都在地上的猫”。它们比较安静，也不会乱跑乱跳，耐受小孩子和狗。它们不喜欢被抱来抱去。
      </p>
    </el-card>
    <el-card shadow="hover">
      <h3>美国短毛猫</h3>
      <img v-lazy="msg4" alt="美国短毛猫" title="美国短毛猫" />
      <p class="a1">
        <span> 生理特征：</span>
        公猫体重大约在5-7公斤，母猫体重大约在3-5.5公斤。美国短毛猫到3、4岁时才会停止发育，寿命在15年左右。没有英国短毛猫那么“敦实”。
        眼睛间距较宽，上眼睑的形状像半个杏仁、下眼睑有着半圆形的曲线，眼睛不像异国短毛猫（加菲猫，见下文）那么圆，且微微上挑。口鼻较短，有着强健的下巴，所以整个脸型有点方。耳朵中等大小，耳尖呈圆形，双耳尖的间距大约是眼睛间距的两倍。
        美国短毛猫的毛比较硬。最经典的颜色就是银色虎斑纹和棕色虎斑纹。
      </p>
      <p class="b3">
        <span> 性格特点：</span>
        美国短毛猫天性良善、随和、在家庭中很受欢迎。它们耐受小孩子，可以表现得十分沉着冷静。母猫往往比公猫更加活泼，而公猫性格往往更加随和。总体上看，它们非常聪明，并对周边事物都很感兴趣。很多美国短毛猫会捕猎入侵家中的昆虫。它们也喜欢从窗台上看外面的鸟和其它活物。它们喜爱人们的陪伴，但是也需要有自己独立的空间。有一些美短喜爱趴在人们腿上，也有一些更倾向于蜷缩在人们附近。
      </p>
    </el-card>
    <el-card shadow="hover"
      ><h3>暹罗猫</h3>
      <img v-lazy="msg5" alt="暹罗猫" title="暹罗猫" />
      <p class="a1">
        <span> 生理特征：</span>
        暹罗猫有着长管状的身体、长腿、细尖的尾巴。脸很长、呈三角形，有着硕大的三角形耳朵。暹罗猫的眼睛十分有特点，呈杏仁状，有着深蓝色，向上倾斜。它们有着又长又直的鼻子。
        暹罗猫毛发短、有光泽、光滑、紧贴身体。
        暹罗猫起初只有海豹色，随后蓝色、巧克力色和浅紫色也被赛事接受。在70年代，出现了虎斑、红色和奶油色斑点暹罗。90年代左右又出现了银色虎斑和烟熏斑。
      </p>
      <p class="b3">
        <span> 性格特点：</span>
        暹罗猫对于需要很多互动和活动的主人来说是非常好的宠物。它们和其它宠物和孩子都能相处得很好。它们友爱、忠诚、粘人、非常需要人的关注。它们很喜欢玩耍、非常喜欢叫，需要花费很多的时间和精力去照顾它们。
      </p>
    </el-card>

    <el-card shadow="hover"
      ><h3>异国短毛猫（加菲）</h3>
      <img v-lazy="msg6" alt="加菲猫" title="加菲猫" />
      <p class="a1">
        <span> 生理特征：</span>
        异国短毛猫是中等体型的猫，有着又大又圆又扁的脸蛋，耳朵位置偏下，眼睛也是又大又圆，鼻子很短，继承了波斯猫的头部缺陷，比如泪腺容易溢出、鼻孔过于狭窄以及牙齿的问题。它们身体又短又强壮、呈现方形，腿和尾巴都又短又粗。异国短毛猫是所有短毛猫种体型最为“浑圆”的。
        异国短毛猫的毛其实并不短，更接近于中等长度，比较容易掉毛，需要一定程度的毛发梳理。
      </p>
      <p class="b3">
        <span> 性格特点：</span>
        异国短毛猫友爱、温顺、有着波斯猫类似的安静特质。它们会用让你无法拒绝的眼神来获得你的关注。它们的短毛猫祖先让它们喜爱玩耍。它们声音很轻柔，能和小孩子和其它宠物和谐共处。它们害怕不熟悉的人，对人类关爱度较低。
      </p>
    </el-card>
    <el-card shadow="hover">
      <h3>波斯猫</h3>
      <img v-lazy="msg7" alt="波斯猫" title="波斯猫" />
      <p class="a1">
        <span> 生理特征：</span>
        波斯猫是中大型的猫咪品种。它们身体较短呈方形，短腿，头很圆，尾巴粗短。眼睛又大又圆，像铜币一样。耳朵很小，圆耳尖，位置较低。鼻子很短，朝天，鼻子和额头之间有明显的凹陷。
        波斯猫的毛发很长，可以长到15厘米，显得雍荣华贵，头部被一圈厚实的颈毛环绕，脖子粗短，毛发顺着身体如流水一般触及地面，尾巴就像是一个厚羽毛掸子。
        波斯猫的毛比较容易打结，需要日常梳理。它们也很容易流眼泪，需要日常擦洗。
      </p>
      <p class="b3">
        <span> 性格特点：</span>
        波斯猫甜美、温柔，它们喜欢安定的环境，并且喜欢被温柔的对待。它们不爱动、不爱玩耍、安静，主要靠它们的大眼睛来交流。它们不会过多地需要人的关注，能在家中独处，胆子比较小。
      </p>
    </el-card>
    <el-card shadow="hover"
      ><h3>缅因猫</h3>
      <img v-lazy="msg8" alt="缅因猫" title="缅因猫" />
      <p class="a1">
        <span>生理特征：</span>
        缅因猫形态特征：中间脸型，耳位高，耳朵大，眼间距较宽，脑门上有M型虎斑。属于大体形的猫，强壮，脚掌大而圆。
        光滑有层次，底层的绒毛细软，背部和腿部的毛长而浓密，尾部的毛像羽毛一样散开。颈部有毛领圈。纯种缅因猫必须具备的特点是：眼圈、嘴唇都是黑色。
        在野外生存的时候，追捕猎物和寻找食物可以对它产生心理刺激，也可以锻炼他的生存能力，猫咪在一次次的胜利之中产生足够的成就感，有利于其身心健康的发展，自然能让它产生愉悦之情。
      </p>
      <p class="b2">
        <span>性格特点：</span
        >缅因猫外表看起来威猛无比，而且全身到处充满了野性美，但是强壮的外表下，对于主人确实最为温驯，最忠心的猫种之一。他另一个不同寻常的特点便是，能发出象小鸟般唧唧的鸟叫声，非常的动听悦耳。
        缅因猫除了忠心，捕鼠武功高强外，更可以说是最聪明的猫种之一。他有时会用前爪捡起食物或树枝，或自己玩一些小把戏自娱自乐，很容易被驯服，可以象小狗一样教会他们一些本事，乳带着项圈和皮带跟着主人走路，缅因猫并不怕水，常常会发现在家里玩水龙头上的滴水，玩的不亦乐乎。
      </p>
    </el-card>
  </div>
</template>

<script >
import msg1 from "../assets/S1.jpg";
import msg2 from "../assets/S2.jpg";
import msg3 from "../assets/S3.jpg";
import msg4 from "../assets/S4.jpg";
import msg5 from "../assets/S5.jpg";
import msg6 from "../assets/S6.jpg";
import msg7 from "../assets/S7.jpg";
import msg8 from "../assets/S8.jpg";
export default {
  data() {
    return {
      msg1,
      msg2,
      msg3,
      msg4,
      msg5,
      msg6,
      msg7,
      msg8,
    };
  },
};
</script>

<style lang="less" scoped>
img {
  width: 170px;
}

.title {
  width: 100%;
  height: 82px;
  line-height: 50px;
  letter-spacing: 6px;
}

.el-card {
  position: relative;
  margin-bottom: 15px;
  letter-spacing: 0.2px;

  span {
    width: 100px;
    height: 100%;
  }

  .a1 {
    display: inline-block;
    width: 900px;
    font-size: 14px;
    line-height: 20px;
    position: absolute;
    left: 225px;
  }

  .a2 {
    display: inline-block;
    width: 900px;
    font-size: 13px;
    line-height: 20px;
    position: absolute;
    left: 225px;
    top: 176px;
  }
  .b2 {
    display: inline-block;
    width: 900px;
    font-size: 13px;
    line-height: 20px;
    position: absolute;
    left: 225px;
    top: 136px;
  }
  .b3 {
    display: inline-block;
    width: 900px;
    font-size: 13px;
    line-height: 20px;
    position: absolute;
    left: 225px;
    top: 152px;
  }
}

span {
  font-size: 18px;
  font-weight: bold;
}

h3 {
  height: 30px;
  font-size: 23px;
  letter-spacing: 2px;
  font-weight: bolder;
  text-align: center;
}
</style>